{"line":["﻿1.基础手势.","1.1.查看上一项、下一项内容,","单只手指在屏幕上快速地平行划动，向右划动可将光标移动到下一项内容，向左划动可将光标移动到上一项内容。","此手势为最常用的浏览手势，可逐项查看手机页面的内容。","1.2.移动光标,","单指在屏幕上任意位置点按或划动，光标会移动到手指点触的地方。","此手势常用于浏览熟悉的页面，可快速选中自己想要的元素。","1.3.切换浏览设置,","单指在屏幕上快速地平行向上或者向下划，可以调整读屏软件的阅读方式，分别有逐字、行、段落、词组、默认等，其中默认为阅读光标所在项内的全部内容。","1.4.点击焦点所在项,","单指快速点按两次，可以对焦点选中的可操作项目进行点击。","1.5.长按,","单指快速点按两次，其中第二次长按。","此手势常用于打开“更多操作”菜单，执行如复制文字、转发信息、删除信息等命令。","2.往复手势.","2.1.移到屏幕的第一项,","单指快速地先向上，再向下划动，即可将光标移动到页面的第一个项目。","2.2.移到屏幕的第二项内容,","先向下，再向上。","2.3.向前滚动,","先向右，再向左。","2.4.向后滚动,","先向左，再向右。","2.5.向上或右移动滑块,","操作1：单指快速地先向右，再向左划动；","操作2：按下音量+键。","此操作一般为增强手机某种功能的输出强度，如提高音量、亮度或读屏软件的语速等。2.6.向下或向左移动滑块,","操作1：单指快速地先向左，再向右划动；","操作2：按下音量-键。","此操作一般为降低手机某种功能的输出强度，如降低音量、亮度或读屏软件的语速等。","3.角度型手势.","3.1.主屏幕按钮,","单指从屏幕的右下角开始，快速、连续地先向上，再向左划动。","此手势为返回主屏幕的快捷手势，可代替主屏幕按钮。","3.2.返回按钮,","单指从屏幕的右上角开始，快速、连续地先向下，再向左划动。","此手势为返回上一菜单的快捷手势，可代替返回按钮。","3.3.应用概览按钮,","单指从屏幕的右下角开始，快速、连续地先向左，再向上划动。","此手势为打开应用概览界面的快捷手势，在一些机型中被称为“最近打开的应用”，在此界面中可以查看、打开、或关闭已打开的应用。","3.4.通知,","操作1：单指从屏幕的左上角开始，快速、连续地先向右，再向下划动；","操作2：双指从屏幕的最上方，往下拉动。","此操作可以打开通知界面，查看应用的通知，还可以对Wi-Fi、流量、蓝牙等功能进行快速设置。","3.5.打开本地上下文菜单,","单指从屏幕的左下角开始，快速、连续地先向上，再向右划动。","此操作可以打开本地上下文菜单，菜单会提供与当前上下文相关的选项。选项可能包括以下内容：","导航选项：“默认”、“字符”、“字词”、“段落”、“按特殊内容朗读”、“按章节朗读”、“按列表朗读”、“按控件朗读”、“行”。","光标控件菜单：编辑文字时，此选项会打开一个包含如下选项的新本地上下文菜单：“将光标移至开头”、“将光标移至末尾”、“全选”和“进入选择模式”。如果选择了相应的文字，您可能会看到以下选项：“剪切”、“复制”、“粘贴”和“退出选择模式”。通过音量键可以移动编辑框中的光标。","“链接”菜单：此选项可以浏览并选择屏幕上的全部链接。","标签控件：此选项可以为没有文字标注的项添加说明，talkback在下次浏览到这个项会读出标签的内容（如屏幕内一个按钮当前读出的内容是“按钮”，在添加名为“搜索”的标签之后，下次光标移动到该按钮之后将会读出“搜索”）","编辑进度滑块控件等级：当焦点位于滑块控件（例如音量或视频播放进度）上时，可以使用该选项设置准确的值（0到100）。","3.6.打开全局上下文菜单,","单指从屏幕的左上角开始，快速、连续地先向下，再向右划动。","此操作可以打开全局上下文菜单，其中功能包括：","从顶部开始朗读：从屏幕顶部开始朗读所有项。","从下一项开始朗读：从上次焦点所在的项开始朗读屏幕上的所有项。","重复上一条语音提示：重新听上一条语音内容。","拼出上一条语音提示：逐个字母地拼出TalkBack的上一条语音提示。","将最后一条语音内容复制到剪贴板：将上次说出的语音内容复制到剪贴板，以便粘贴到其他应用。","暂停语音反馈：选择此选项将会暂停TalkBack，其中包括通知和“触摸浏览”。暂停后，TalkBack默认在屏幕开启和锁定屏幕显示时恢复启用，也可以通过通知栏恢复启用，可以在TalkBack设置中选择重启方式。","TalkBack设置：选择此选项会打开TalkBack设置页面。","文字转语音设置：选择此选项可更改您的文字转语音设置。","调暗屏幕：降低屏幕的亮度。","4.其他.","4.1.划动屏幕,","双指同时、同方向划动屏幕。","4.2.缩放屏幕,","两根手指放在屏幕上，然后张开或合并双指"]}